---
kind: method
id: M:Autodesk.Revit.DB.FabricationConnectorInfo.IsValid
source: html/f4a0d5d8-f0bf-c54f-e1c6-c3f268008621.htm
---
# Autodesk.Revit.DB.FabricationConnectorInfo.IsValid Method

Checks if the connector has fabrication parameters associated with it that can be set.

## Syntax (C#)
```csharp
public bool IsValid()
```

## Returns
True if the connector has fabrication parameters associated with it that can be set.